import {Text, View, Animated} from '@components';
import React from 'react';
import {SafeAreaView} from 'react-native-safe-area-context';
import {useRef, useCallback} from '@hooks';
import {AnimatedHeader} from './components';
import styles from './styles';
type TSmartInvestProps = {};

const SmartInvest: React.FC<TSmartInvestProps> = () => {
  const headerRef = useRef<Animated.Value>(new Animated.Value(0)).current;

  const onScroll = useCallback(
    Animated.event([{nativeEvent: {contentOffset: {y: headerRef}}}], {
      useNativeDriver: true,
    }),
    [],
  );
  return (
    <SafeAreaView style={styles.container}>
      <AnimatedHeader scrollY={headerRef} />
      <Animated.ScrollView
        showsVerticalScrollIndicator={false}
        scrollEventThrottle={1}
        contentContainerStyle={styles.contentContainer}
        onScroll={onScroll}
        style={styles.content}>
        <View>
          <Text style={styles.title}>Заголовок</Text>
          <Text style={styles.description}>
            У 4 кв 2019 кількість користувачів мобільного інтернету досягла 16,9
            млн, на 14,6% більше, ніж у 4 кв. 2018. Споживання дата трафіку
            зросло з 2753 МБ у 4 кв. 2018 до 4263 МБ на абонента у 4 кв. 2019.
            Завдяки збільшенню обсягів споживання і кількості користувачів
            інтернету, показник ARPU у 4 кв 2019 збільшився на 17,4% до 68 грн.
            Використання послуг голосового зв’язку майже не змінилось. У 4 кв.
            2019 абоненти в середньому використовували по 577 хвилин щомісяця.
            Загальний операційний дохід від послуг мобільного зв’язку в 4 кв.
            2019 збільшився на 15,3% до 5,4 млрд грн.
          </Text>
        </View>
        <View>
          <Text style={styles.title}>Заголовок</Text>
          <Text style={styles.description}>
            Кількість абонентів, які використовують по декілька SIM-карт різних
            операторів, поступово зменшується, що є загальним ринковим трендом.
            У результаті цього тренду в 4 кв. 2019 кількість SIM-карток
            зменшилась на 0,6% у порівнянні з 4 кв 2018. Послугами мобільного
            зв’язку в 4 кв.2019 користувалось 26,2 млн абонентів. Доходи від
            фіксованого зв’язку в 4 кв 2019 збільшились на 14%, у порівнянні з 4
            кв 2018, до 355 млн грн. Головним чином завдяки збільшенню на 10,8%
            кількості абонентів послуги широкосмугової передачі даних («Домашній
            Інтернет»). Драйвером росту в цьому сегменті залишається унікальна
            пропозиція «Київстар. Усі разом», за умовами якого абоненти
            користуються мобільним зв’язком, фіксованим інтернетом і цифровим
            телебаченням по єдиному рахунку, і отримують суттєві знижки на
            абонплату. Показник ARPU «Домашнього Інтернету» зріс на 6,2%, у
            порівнянні з 4 кв.2018, до 75 грн. Загальний дохід Київстар у 4 кв.
            2019 збільшився на 16,1% у порівнянні з 4 кв. 2018, до 5,8 млрд грн.
            У 4 кв. 2019 капітальні інвестиції перевищили на 114,4% аналогічний
            показник 4 кв. 2018. Усього за 2019 рік компанія інвестувала у
            розвиток інфраструктури понад 5 млрд грн. Це дозволило охопити
            зв’язком 4G територію, де мешкає понад 74% населення України.
            Відповідно до досліджень ряду міжнародних компаній за 2019 рік,
            швидкість мобільного інтернету в мережі Київстар, у середньому,
            вище, ніж в інших мобільних мережах України. У 2019 році Київстар
            перерахував до державного бюджету податків та інших платежів на
            загальну суму 7,8 млрд грн. Понад 3 млн грн було інвестовано у
            соціальні ініціативи та проєкти.
          </Text>
        </View>
      </Animated.ScrollView>
    </SafeAreaView>
  );
};

export default SmartInvest;
